## Plan Result (prod_global)




<pre><code>Plan: 8 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;portal-beta&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_D[&#34;portal-beta&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin_redirect[&#34;portal-beta&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group_redirect[&#34;portal-beta&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_D[&#34;portal-beta&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.redirect_hostname[&#34;portal-beta&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.redirect_hostname_rule_set[&#34;portal-beta&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;portal-beta&#34;]
* Update
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;div-pfe&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["portal-beta"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod"
      + expiration_date          = (known after apply)
      + host_name                = "portal-beta.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "portal-beta"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_D["portal-beta"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_D" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin_redirect["portal-beta"] will be created
  + resource "azurerm_cdn_frontdoor_origin" "front_door_origin_redirect" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = "portal-beta.platform.hmcts.net"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "portal-beta"
      + priority                       = 1
      + weight                         = 50
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group_redirect["portal-beta"] will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "origin_group_redirect" {
      + cdn_frontdoor_profile_id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod"
      + id                                                        = (known after apply)
      + name                                                      = "portal-beta"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = false

      + load_balancing {
          + additional_latency_in_milliseconds = 0
          + sample_size                        = 4
          + successful_samples_required        = 2
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_D["portal-beta"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_D" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/afdEndpoints/hmcts-prod"
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + cdn_frontdoor_rule_set_ids      = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = true
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "portal-betaredirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
          + "Https",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.redirect_hostname["portal-beta"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "redirect_hostname" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "portalbetaredirectrule"
      + order                       = 1

      + actions {
          + url_redirect_action {
              + destination_hostname = "portal.platform.hmcts.net"
              + redirect_protocol    = "Https"
              + redirect_type        = "Moved"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.redirect_hostname_rule_set["portal-beta"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "redirect_hostname_rule_set" {
      + cdn_frontdoor_profile_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod"
      + id                       = (known after apply)
      + name                     = "portalbetaredirectruleset"
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["div-pfe"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "5bz95ky3c27gb6475yz0yx2x1g4wg6qc" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["portal-beta"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.portal-beta"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "platform.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 8 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1925,"Program":"tfcmt","SHA1":"","Target":"prod_global","Vars":{}} -->